###  Part # 1
  #### Terraform Initialization `success`
  #### Terraform Plan `success`
  ```
  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_route_table.internet-to-public-mastodon-route-table will be destroyed
  # (because aws_route_table.internet-to-public-mastodon-route-table is not in configuration)
  - resource "aws_route_table" "internet-to-public-mastodon-route-table" {
      - arn              = "arn:aws:ec2:eu-west-3:377346518720:route-table/rtb-0e145334c630df961" -> null
      - id               = "rtb-0e145334c630df961" -> null
      - owner_id         = "377346518720" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = "igw-0c22565fd66fefcb9"
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Name" = "internet-to-public-mastodon-route-table"
        } -> null
      - tags_all         = {
          - "Env"  = "prd"
          - "Name" = "internet-to-public-mastodon-route-table"
        } -> null
      - vpc_id           = "vpc-05c566a68c1b1624b" -> null
    }

  # aws_route_table.private-mastodon-route-table will be created
  + resource "aws_route_table" "private-mastodon-route-table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = "eni-0c34a64884901434a"
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "private-mastodon-route-table"
        }
      + tags_all         = {
          + "Env"  = "prd"
          + "Name" = "private-mastodon-route-table"
        }
      + vpc_id           = "vpc-05c566a68c1b1624b"
    }

  # aws_route_table.public-mastodon-route-table will be created
  + resource "aws_route_table" "public-mastodon-route-table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-0c22565fd66fefcb9"
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "public-mastodon-route-table"
        }
      + tags_all         = {
          + "Env"  = "prd"
          + "Name" = "public-mastodon-route-table"
        }
      + vpc_id           = "vpc-05c566a68c1b1624b"
    }

  # aws_route_table.public-mastodon-to-private-mastodon-route-table will be destroyed
  # (because aws_route_table.public-mastodon-to-private-mastodon-route-table is not in configuration)
  - resource "aws_route_table" "public-mastodon-to-private-mastodon-route-table" {
      - arn              = "arn:aws:ec2:eu-west-3:377346518720:route-table/rtb-001d05daa47a1f98f" -> null
      - id               = "rtb-001d05daa47a1f98f" -> null
      - owner_id         = "377346518720" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = "eni-0c34a64884901434a"
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Name" = "public-mastodon-to-private-mastodon-route-table"
        } -> null
      - tags_all         = {
          - "Env"  = "prd"
          - "Name" = "public-mastodon-to-private-mastodon-route-table"
        } -> null
      - vpc_id           = "vpc-05c566a68c1b1624b" -> null
    }

  # aws_route_table_association.private-mastodon-route-table-association will be updated in-place
  ~ resource "aws_route_table_association" "private-mastodon-route-table-association" {
        id             = "rtbassoc-090915b97164fa2e0"
      ~ route_table_id = "rtb-001d05daa47a1f98f" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_route_table_association.public-mastodon-route-table-association will be updated in-place
  ~ resource "aws_route_table_association" "public-mastodon-route-table-association" {
        id             = "rtbassoc-0c94842536d23d0f8"
      ~ route_table_id = "rtb-0e145334c630df961" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.

  ```
  *Pusher: @iMichka, Action: `pull_request`, Workflow: `Terraform`*